puts "Введите первый коэффициент"
a = gets.chomp.to_i
puts "Введите второй коэффициент"
b = gets.chomp.to_i
puts "Введите третий коэффициент"
c = gets.chomp.to_i
D = b ** 2 - 4 * a * c
if D > 0
  x1 = (-b + Math.sqrt(D)) / 2 * a
  x2 = (-b - Math.sqrt(D)) / 2 * a
  puts "Дискриминант равен #{D}, первый корень дискриминанта равен #{x1}, второй корень дискриминанта равен #{x2}"
elsif D == 0
  x1 = (-b + Math.sqrt(D)) / 2 * a
  puts "Дискриминант равен #{D}, корень дискриминанта равен #{x1}"
else
  puts "Корней нет"
end